## 116 뇌단련에 대해
클래스 관리 문제를 생각해볼 때 스타버즈 커피 예시는 디자인 원칙 가운데 무엇을 제대로 지킺 않고 있는 것일까요?
-> 바뀌는 부분 캡슐화, 상속보다는 구성을 활용한다.
클래스가 폭발한다는 부분에서 바뀌는 부분이 캡슐화 되지 않는다는 걸 알 수 있음
첨가물을 어떤 음료이든 자유롭게 첨가할 수 있다는 점에서 느슨한 결합이라고 볼 수 있을 것 같음

## 121 실제 사례에 대해
jdsc를 mysql로 바꾸는 경우를 생각했을 때, 하드코딩하는게 니라 객체부분만 바꾸어주면됨 이런 사례를 생각하면 되지 않을까~~
나같은 경우 큰 프로젝트를 해본 적이 없는데, ocp가 좋다는 이야기만 듣다가 굳이 그렇게 할 필요가 없다라는 말을 보니 헷갈렸다.

## 127 인터페이스를 사용하면 데코레이터 패턴이 될 수 있는가?(인터페이스 = 데코레이터 패턴)?
131 페이지를 보면 참조하는 객체를 대입해주고 하는 즉, 참조하는 것이 있는 것이 데코레이터 핵심인데, 그럴 필요가 없는 코드는 데코레이터 패턴을 적용할 필요 없는 코드가 아닌가
인터페이스로 구현한 것 중에 데코레이터 패턴이 될 수 있는 것도 있고 그렇지 않은 것도 있음 즉 인터페이스 구현이 데코레이터 패턴보다 더 큰 개념임

## 131 인스턴스 변수를 감싸고자 하는 객체로 설정하는 생성자란 무엇일까?
인스턴스 변수는 this.beverage이고 감싸고자 하는 객체는 인자로 전달된 beverage이다.
this.beverage는 초기화가 안된 상태인데 Beverage beverage로 초기화를 시켜주는 것

## 137 특정 형식에 의존하는 클라이언트 코드란 무엇일까?
기존의 구성요소를 데코레이터로 감싸게 되면, 구성요소를 알 수 없게 됨. 구성 요소를 알아야만 하는 상황이 있는 것은 아닐까?
관련해서 133p houseblend를 데코레이터로 감싸고 나면 커피가 하우스 블렌드인지 다크 로스트인지 알 수 없다. 이런 상황에서 구상 구성 요소로 특별 할인 같은 작업을 처리할 때 문제가 생기지 않을까
